# Напишите ваше решение
q = float(input('Ввод а: '))
v = float(input('Ввод n: '))
c = q ** v
print(c)