# Напишите ваше решение

a = int(input("Число 1 :"))
b = int(input("Число 2 :"))
c = int(input("Число 3 :"))
list_n = [a, b, c]
print (min(list_n))


