# Напишите ваше решение
task = 10.0
avg_time = float(input("Среднее время на 1 задание: "))

time_score_hour = task * (avg_time / 60)
print(time_score_hour)
