# Напишите ваше решение
# Напишите ваше решение
nalog_const = 13
solary_netto = int(input ('Ваш оклад: '))
nalog_ndfl = (nalog_const / 100) * solary_netto
solary_brutto = solary_netto - nalog_ndfl
print(nalog_ndfl)
print(solary_brutto)